#pragma once
#ifndef _angle_h
#define _angle_h
#define PI 3.1415926
#define j2h(x) (PI*(x)/180)//角度转换弧度
/*
--------------------------------------------------------------------------------
void turn(double turn);

函数功能：转动角度turn
--------------------------------------------------------------------------------
*/
void turn(double turn);

/*
--------------------------------------------------------------------------------
void move(double length)

函数功能：沿着当前角度移动笔length距离
--------------------------------------------------------------------------------
*/
void move(double length);

/*
--------------------------------------------------------------------------------
void forward(double length)

函数功能：沿着当前角度画lenght长度的线
--------------------------------------------------------------------------------
*/
void forward(double length);


#endif // !_angle_h

