/********************
*   DrawMenuBar.h
*
*   函数介绍：包含画菜单栏以及相关鼠标、键盘回调
*   调用接口：
*
*
*
*
*
*   创建时间：2019.5.12  10:30
*
*
******************/

#pragma once
#ifndef _DrawMenuBar_h
#define _DrawMenuBar_h

/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
void MenuBar();

函数功能：画出菜单栏
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
void MenuBar();

/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
int Mouse_about_MenuBar(int x,int y,int button,int event);

函数功能：鼠标回调中调用此函数，判断鼠标与菜单栏相关的行为
参数说明：
	x:鼠标返回的横坐标
	y:鼠标返回的纵坐标
	button:鼠标按钮
	event:鼠标事件
	-->》参数同鼠标回调函数
返回值：
	 1:点击了新游戏，执行保存并设置
	 2:点击了新游戏，执行设置
	 3:点击了载入，执行保存并载入
	 4:点击了载入，执行载入
	 5:点击了保存，执行保存
	 6:点击了退出，执行保存并退出
	 7:点击了帮助，执行显示规则
	 8:点击了暂停，执行暂停
	 9:点击了继续，执行继续
	 0:others
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
int Mouse_about_MenuBar(int x, int y, int button, int event);

/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
int KeyBoard_about_MenuBar(int key,int event);

函数功能：键盘回调中调用此函数，判断键盘与菜单栏相关的行为
参数说明：
	key:键盘按键
	event:键盘事件
	-->》参数同键盘回调函数
返回值：
	 1:点击了新游戏，执行保存并设置
	 2:点击了新游戏，执行设置
	 3:点击了载入，执行保存并载入
	 4:点击了载入，执行载入
	 5:点击了保存，执行保存
	 6:点击了退出，执行保存并退出
	 7:点击了帮助，执行显示规则
	 8:点击了暂停，执行暂停
	 9:点击了继续，执行继续
	 0:others
---------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
int KeyBoard_about_MenuBar(int key, int event);


#endif
