#pragma once
#ifndef _Map1_demo_h
#define _Map1_demo_h

typedef struct Cell_All {
	string name;//地名 
	int cell_kind;/*判断类型  0为起点 1为土地  2为机会  3为所得税  
				  4为火车站  5为电力公司与自来水厂  6为医院  
				  7为监狱 8为停车场*/
	int owner;//拥有者 ,值为-1时代表无主 
	int construt_fee;//建筑费 
	int house;//房子个数 ，上限为4 
	int tolls[5];//根据当前房子个数收取过路费 
	int mortgage_fee;//抵押费 

}*Cell_AllT;

/*
--------------------------------------------------------------------------------------------------
void MainMap1();

函数说明：新游戏 开始画Map1
--------------------------------------------------------------------------------------------------
*/
void MainMap1();//Map1主函数 

/*
--------------------------------------------------------------------------------------------------
void DrawMap1();

函数说明：载入 画Map1
--------------------------------------------------------------------------------------------------
*/
void DrawMap1(int);

/*
--------------------------------------------------------------------------------------------------
int Mouse_Map1(int x, int y, int button, int event);

函数说明：鼠标回调函数中调用此函数，执行与地图有关的鼠标行为
参数说明：同鼠标回调函数
返回值：
	 1:点击了新游戏，执行保存并设置
	 2:点击了新游戏，执行设置
	 3:点击了载入，执行保存并载入
	 4:点击了载入，执行载入
	 5:点击了保存，执行保存
	 6:点击了退出，执行保存并退出
	 7:点击了帮助，执行显示规则
	 8:点击了暂停，执行暂停
	 9:点击了继续，执行继续
	 0:others
--------------------------------------------------------------------------------------------------
*/
int Mouse_Map1(int x, int y, int button, int event);

/*
--------------------------------------------------------------------------------------------------
int KeyBoard_Map1(int key, int event);

函数说明：键盘回调函数中调用此函数，执行与Map1相关的键盘行为
参数说明：同键盘回调函数
返回值：同菜单栏
	 1:点击了新游戏，执行保存并设置
	 2:点击了新游戏，执行设置
	 3:点击了载入，执行保存并载入
	 4:点击了载入，执行载入
	 5:点击了保存，执行保存
	 6:点击了退出，执行保存并退出
	 7:点击了帮助，执行显示规则
	 8:点击了暂停，执行暂停
	 9:点击了继续，执行继续
	 0:others
--------------------------------------------------------------------------------------------------
*/
int KeyBoard_Map1(int key, int event);

/*
--------------------------------------------------------------------------------------------------
void Timer_Map1();

函数说明：定时器回调函数中调用此函数，转转盘
--------------------------------------------------------------------------------------------------
*/
void Timer_Map1();

/*
--------------------------------------------------------------------------------------------------
void InitCelldata();

函数说明：初始化地图数据
--------------------------------------------------------------------------------------------------
*/
void InitCelldata();//初始化地图数据 

/*
--------------------------------------------------------------------------------------------------
void begingame();

函数功能：实现游戏
--------------------------------------------------------------------------------------------------
*/
void begingame();

#endif // !_Map1_demo_h

