#pragma once
#ifndef _morecolor_h
#define _morecolor_h
/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------
*"grey"----------深灰色
*"lightgrey"-----更温柔点的灰色
*"deepblue"------深蓝
*"navyblue"------海军蓝
*"deepgreen"-----盛夏的树叶
*"grass"---------草绿
*"gingeryellow"--姜黄色
*"orange"--------一颗大橘子
*"rred"----------复古的红色
*"pink"----------粉色
*"purple"--------葡萄紫
*"smoke"---------万能百搭浅灰色
*"khaki"---------浅卡其色
*"babyblue"------baby蓝
*"babypink"------奶油粉
*"matcha"--------抹茶拿铁
*"VC"------------橙子味的气泡水
*"lavender"------薰衣草
---------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
void MoreColor();

#endif