#pragma once
#ifndef _save_h
#define _save_h

/*
-----------------------------------------------------------------------------------------------
void DrawSave();

函数说明：画出保存界面
-----------------------------------------------------------------------------------------------
*/
void DrawSave();

/*
-----------------------------------------------------------------------------------------------
void Mouse_about_Save(int x, int y, int button, int event);

函数说明：鼠标回调函数中调用此函数，执行与保存有关的鼠标行为
参数说明：同鼠标回调函数
返回值：1-点击返回
		2-完成保存
		0-others
-----------------------------------------------------------------------------------------------
*/
int Mouse_about_Save(int x, int y, int button, int event);/*鼠标消息回调函数*/

/*
-----------------------------------------------------------------------------------------------
void Char_about_Save(char c);

函数说明：字符回调函数中调用此函数，执行与保存有关的字符行为
参数说明：同字符回调函数
-----------------------------------------------------------------------------------------------
*/
void Char_about_Save(char c);/*字符消息回调函数*/

/*
-----------------------------------------------------------------------------------------------
void Keyboard_about_Save(int key, int event);

函数说明：键盘回调函数中调用此函数，执行与保存有关的键盘行为
参数说明：同键盘回调函数
-----------------------------------------------------------------------------------------------
*/
void Keyboard_about_Save(int key, int event);/*键盘消息回调函数*/

#endif // !_save_h

